//  5. Написать программу вычисления значения функции y=f(a)

double F(double a)
{
    return Math.Sin (a);
}

Console.Write(F(2));
